Autodesk.Revit.DB.Mechanical.DuctSystemType
Since:
2012
An enumerated type listing all the possible duct system types for a connector object.
Since:
2012

Autodesk.Revit.DB.Mechanical.DuctSystemType.Global
Duct System Type is Global.

Autodesk.Revit.DB.Mechanical.DuctSystemType.Fitting
Duct System Type is Fitting.

Autodesk.Revit.DB.Mechanical.DuctSystemType.OtherAir
Duct System Type is OtherAir.

Autodesk.Revit.DB.Mechanical.DuctSystemType.ExhaustAir
Duct System Type is ExhaustAir.

Autodesk.Revit.DB.Mechanical.DuctSystemType.ReturnAir
Duct System Type is ReturnAir.

Autodesk.Revit.DB.Mechanical.DuctSystemType.SupplyAir
Duct System Type is SupplyAir.

Autodesk.Revit.DB.Mechanical.DuctSystemType.UndefinedSystemType
Undefined system type.